#!/usr/bin/env python3
#-*- coding: utf-8 -*-
#github.com/AngelSecurityTeam/Cam-Hackers

import requests, re , colorama
colorama.init()
print("""
\033[1;31m\033[1;37m 
 ██████╗ █████╗ ███╗   ███╗      ██╗  ██╗ █████╗  ██████╗██╗  ██╗███████╗██████╗ ███████╗
██╔════╝██╔══██╗████╗ ████║      ██║  ██║██╔══██╗██╔════╝██║ ██╔╝██╔════╝██╔══██╗██╔════╝
██║     ███████║██╔████╔██║█████╗███████║███████║██║     █████╔╝ █████╗  ██████╔╝███████╗
██║     ██╔══██║██║╚██╔╝██║╚════╝██╔══██║██╔══██║██║     ██╔═██╗ ██╔══╝  ██╔══██╗╚════██║
╚██████╗██║  ██║██║ ╚═╝ ██║      ██║  ██║██║  ██║╚██████╗██║  ██╗███████╗██║  ██║███████║
\033[1;31m ╚═════╝╚═╝  ╚═╝╚═╝     ╚═╝      ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚══════╝
\033[1;31m                                                      ANGELSECURITYTEAM | Перевод by Vale25
\033[1;31m1) \033[1;37mСША                        \033[1;31m31) \033[1;37mМексика                     \033[1;31m61) \033[1;37mМолдова
\033[1;31m2) \033[1;37mЯпония                     \033[1;31m32) \033[1;37mФинляндия                   \033[1;31m62) \033[1;37mНикарагуа
\033[1;31m3) \033[1;37mИталия                     \033[1;31m33) \033[1;37mКитай                       \033[1;31m63) \033[1;37mМальта
\033[1;31m4) \033[1;37mКорея                      \033[1;31m34) \033[1;37mЧили                        \033[1;31m64) \033[1;37mТринидад И Тобаго
\033[1;31m5) \033[1;37mФранция                    \033[1;31m35) \033[1;37mЮжная Африка                \033[1;31m65) \033[1;37mСеверная Аравия
\033[1;31m6) \033[1;37mГермания                   \033[1;31m36) \033[1;37mСловакия                    \033[1;31m66) \033[1;37mХорватия
\033[1;31m7) \033[1;37mТайвань                    \033[1;31m37) \033[1;37mВенгрия                     \033[1;31m67) \033[1;37mКипр
\033[1;31m8) \033[1;37mРоссийская Федерация       \033[1;31m38) \033[1;37mИрландия                    \033[1;31m68) \033[1;37mПакистан
\033[1;31m9) \033[1;37mОбъединенное Королевство   \033[1;31m39) \033[1;37mЕгипет                      \033[1;31m69) \033[1;37mОбъединенные Арабские Эмираты
\033[1;31m10) \033[1;37mНидерланды                \033[1;31m40) \033[1;37mТаиланд                     \033[1;31m70) \033[1;37mКазахстан
\033[1;31m11) \033[1;37mЧешская Республика        \033[1;31m41) \033[1;37mУкраина                     \033[1;31m71) \033[1;37mКувейт
\033[1;31m12) \033[1;37mТурция                    \033[1;31m42) \033[1;37mСербия                      \033[1;31m72) \033[1;37mВенесуэла
\033[1;31m13) \033[1;37mАвстрия                   \033[1;31m43) \033[1;37mГонконг                     \033[1;31m73) \033[1;37mГрузия
\033[1;31m14) \033[1;37mШвейцария                 \033[1;31m44) \033[1;37mГреция                      \033[1;31m74) \033[1;37mЧерногория
\033[1;31m15) \033[1;37mИспания                   \033[1;31m45) \033[1;37mПортугалия                  \033[1;31m75) \033[1;37mСальвадор
\033[1;31m16) \033[1;37mКанада                    \033[1;31m46) \033[1;37mЛатвия                      \033[1;31m76) \033[1;37mЛюксембург
\033[1;31m17) \033[1;37mШвеция                    \033[1;31m47) \033[1;37mСингапур                    \033[1;31m77) \033[1;37mКюрасао
\033[1;31m18) \033[1;37mИзраиль                   \033[1;31m48) \033[1;37mИсландия                    \033[1;31m78) \033[1;37mПуэрто-Рико
\033[1;31m19) \033[1;37mИран                      \033[1;31m49) \033[1;37mМалайзия                    \033[1;31m79) \033[1;37mКоста-Рика
\033[1;31m20) \033[1;37mПольша                    \033[1;31m50) \033[1;37mКолумбия                    \033[1;31m80) \033[1;37mБелоруссия
\033[1;31m21) \033[1;37mИндия                     \033[1;31m51) \033[1;37mТунис                       \033[1;31m81) \033[1;37mАлбания
\033[1;31m22) \033[1;37mНорвегия                  \033[1;31m52) \033[1;37mЭстония                     \033[1;31m82) \033[1;37mЛихтенштейн
\033[1;31m23) \033[1;37mРумыния                   \033[1;31m53) \033[1;37mДоминиканская Республика    \033[1;31m83) \033[1;37mБосния И Герцеговина
\033[1;31m24) \033[1;37mВьетнам                   \033[1;31m54) \033[1;37mСловения                    \033[1;31m84) \033[1;37mПарагвай
\033[1;31m25) \033[1;37mБельгия                   \033[1;31m55) \033[1;37mЭквадор                     \033[1;31m85) \033[1;37mФилиппины
\033[1;31m26) \033[1;37mБразилия                  \033[1;31m56) \033[1;37mЛитва                       \033[1;31m86) \033[1;37mФарерские острова
\033[1;31m27) \033[1;37mБолгария                  \033[1;31m57) \033[1;37mПалестина                   \033[1;31m87) \033[1;37mГватемала
\033[1;31m28) \033[1;37mИндонезия                 \033[1;31m58) \033[1;37mНовая Зеландия              \033[1;31m88) \033[1;37mНепал
\033[1;31m29) \033[1;37mДания                     \033[1;31m59) \033[1;37mБангладеш                   \033[1;31m89) \033[1;37mПеру
\033[1;31m30) \033[1;37mАргентина                 \033[1;31m60) \033[1;37mПанама                      \033[1;31m90) \033[1;37mУругвай
\033[1;31m91) \033[1;37mРандом
""")

try:
    print()
    countries = ["US", "JP", "IT", "KR", "FR", "DE", "TW", "RU", "GB", "NL",
                 "CZ", "TR", "AT", "CH", "ES", "CA", "SE", "IL", "PL", "IR",
                 "NO", "RO", "IN", "VN", "BE", "BR", "BG", "ID", "DK", "AR",
                 "MX", "FI", "CN", "CL", "ZA", "SK", "HU", "IE", "EG", "TH",
                 "UA", "RS", "HK", "GR", "PT", "LV", "SG", "IS", "MY", "CO",
                 "TN", "EE", "DO", "SI", "EC", "LT", "PS", "NZ", "BD", "PA",
                 "MD", "NI", "MT", "IT", "SA", "HR", "CY", "PK", "AE", "KZ",
                 "KW", "VE", "GE", "ME", "SV", "LU", "CW", "PR", "CR", "BY",
                 "AL", "LI", "BA", "PY", "PH", "FO", "GT", "NP", "PE", "UY",
                 "-"]
    headers = {"User-Agent": "Mozilla/5.0 (X11; Linux i686; rv:68.0) Gecko/20100101 Firefox/68.0"}
    print("""\033[1;31mОстановить программу можно нажав 'Ctrl+C'!""")
    print("\033[1;37m")
    num = int(input("Настройка: "))
    if num not in range(1, 91+1):
        print("""\033[1;31mОшибка настройки""")
        raise IndexError

    country = countries[num-1]
    res = requests.get(
        f"https://www.insecam.org/en/bycountry/{country}", headers=headers
    )
    last_page = re.findall(r'pagenavigator\("\?page=", (\d+)', res.text)[0]

    for page in range(int(last_page)):
        res = requests.get(
            f"https://www.insecam.org/en/bycountry/{country}/?page={page}",
            headers=headers
        )
        find_ip = re.findall(r"http://\d+.\d+.\d+.\d+:\d+", res.text)
        for ip in find_ip:
            print("\033[1;31m", ip)
except:
    pass
finally:
    print("\033[1;37m")
    exit()
